0001F SYNTAX ERROR
0002F NOT A COBOL WORD
0003F SYNTAX ERROR OR PERIOD MISSING FROM
        PRIOR LINE
0004F FILE NOT SELECTED IN THE INPUT-OUTPUT
        SECTION
0005F OCCURS LIMITED TO ONE LEVEL
0006F SUBSCRIPTED ITEMS CANNOT BE REDEFINED
0007F PICTURE ITEMS MUST BE ELEMENTRY
0008F EDITED PICTURE CONTAINS
        ILLEGAL COMBINATIONS
0009F MAX RECORD LENGTH OF 4095 EXCEEDED
0010F ELEMENTRY ITEM DOES NOT HAVE PICTURE CLAUSE
0011F ILLEGAL REDEFINES DUE TO INCORRECT REFERENCES
0012F SUBSCRIPT ERROR
0013F ILLEGAL COMBINATION OF CHARACTERS IN
        PICTURE
0014F DUPLICATION OF PREVIOUS NAME IS ILLEGAL
0015F ENVIRONMENT DIVISION MISSING
0016F FD MUST CONTAIN A LABEL RECORD CLAUSE
0017F VALUE OF FILE-ID MISSING
0018F SUBSCRIPT LITERAL CONTAINS ILLEGAL CHARACTER
0019F USAGE CONFLICT
0020F OCCURS CLAUSE IS ILLEGAL AT 01 LEVEL
0021F VALUE IS ILLEGAL WITH OCCURS
0022F VALUE IS ILLEGAL FOR REDEFINED ITEMS
0023F ILLEGAL CHARACTER IN WORD
0024F MUST HAVE RELATIVE KEY
0025F MUST BE IN WORKING STORAGE
0026F KEY NOT ELEMENTRY
0027F RELATIVE KEY WRONG SIZE [PICTURE 9(7) max]
0028F PARAGRAPH NAME IS NOT DEFINED
0029F PARAGRAPH NAME IS NOT ALTERABLE
0030F TOO MANY FILES SELECTED LIMIT IS 12
0031F MORE MEMORY NEEDED OR REDUCE SIZE OF LABELS
0032F CORRECT ALL ERRORS AND RECOMPILE
0033F MISSING DIVISION STATEMENT
0034F MORE MEMORY NEEDED TOO MANY PARAGRAPH NAMES
0035F PUT FREQUENTLY USED PARAGRAPHS AT BEGINNING
0036F TEMP OVERFLOW NOTIFY ELLIS COMPUTING
0037F LEVELS 01-10 AND 77 ONLY
0038F IS NOT DEFINED
0039F " IS MISSING COL 10 CONTINUED NONNUMERIC LIT
0040F ILLEGAL HEXADECIMAL CHARACTER (0-9 OR A-F)
0041F ILLEGAL FILE-ID "U:FILE.TYP"
0042F ASCII (DISPLAY) DATA TYPE REQUIRED
0043F RANDOM FILES MUST USE INVALID KEY CLAUSE
0044F OPEN I-O MUST BE THE SAME AS SELECT I-O
0045F VALUE/PICTURE SIGN ERROR
0046F COPY CANNOT ALSO COPY
0047F COPY FILE NAME MUST BE 10 CHARACTERS OR LESS
0048F COULD NOT FIND REDEFINED ITEM NAME
0049F LITERAL EXCEEDS 120 CHARACTER LIMIT
0050W LITERAL TRUNCATED RIGHT END
0051W MORE THEN 30 CHARACTERS IN A WORD
0052F LITERAL LONGER THAN PICTURE
0053W REDEFINED AREA ADJUSTED
0054W EDITED PICTURE MODIFIED
0055W TWO RECORDS IN A FILE HAVE
        DIFFERENT SIZES
0056W COLUMN 5 TREATED AS COMMENTS
0057W LINE NUMBERS OUT OF SEQUENCE
0058W RANDOM FILE CANNOT BE DELIMITED
0059W PERIOD IS MISSING AFTER PREVIOUS WORD
0060F DECIMAL POINT SIZES DIFFERENT
0061W PRINTER CANNOT BE DELIMITED
0062F VALUE EXCEEDS 5 DIGITS FOR COMP
0063F ILLEGAL VALUE FOR COMP
0064F ILLEGAL CURRENCY SIGN
0065F COPY MUST HAVE DRIVE U:FILE-NAME.
0066W ALL LITERAL LIMITED TO 1 BYTE
0067F ZERO MISSING IN BLANK WHEN ZERO
0068F BLANK WHEN ZERO NOT ALLOWED AT
        GROUP LEVEL
0069F BLANK WHEN ZERO MUST BE ASCII/DISPLAY
0070F BLANK WHEN ZERO FOR NUMERIC ITEM ONLY
0071F JUSTIFIED MUST BE A ELEMENTRY DATA ITEM
0072F JUSTIFIED CANNOT BE NUMERIC OR EDITED
0073W MEMORY ADDRESS EXCEEDS CURRENT CP/M
        BASE ADDRESS
0074F MORE THAN 255 LINKAGE SECTION DATA-NAMES
0075F PD USING WITH NO LINKAGE SECTION
0076F IF/UNTIL NESTED CONDITIONALS ARE ILLEGAL
0077F RESERVED WORD  SENTENCE  IS MISSING
0078F ONLY PRINTER FILES CAN BE 'OMITTED'
0079F DUPLICATE LABEL CLAUSE
0080MEMORY AVAILABLE
      * SUCCESSFUL COMPILE
0081F OBJECT MEMORY OVERFLOW
        CORRECT AND RECOMPILE
0082F ADVANCING FOR PRINTER FILES ONLY
0083F REDEFINES AT 01 LEVEL IN FILE SECTION
0084F COMP AND COMP-3 CANNOT CONTAIN EDIT SYMBOLS
0085PROGRAM NAME
0086 LINE   C SEQ    ERR
0087  NO.   P NO. COL    LVL TEXT
0088ENTER <CR> FOR NEXT PAGE
0089 ;ERROR MESSAGE NEXT LINE:
0090 90 NO ADDITIONAL INFORMATION
0091 91 ERROR IN EXTENDING THE FILE
0092 92 END OF DISK DATA - DISK IS FULL
0093 93 FILE NOT OPEN
0094 94 NO MORE DIRECTORY SPACE - DISK IS FULL
0095 95 FILE CANNOT BE FOUND
0096 96 FILE ALREADY OPEN
0097 97 READING UNWRITTEN DATA IN RANDOM ACCESS
0098 98 REWRITE WITHOUT PRIOR READ IN I-O MODE
0099 99 READING AN OUTPUT FILE OR
        WRITING TO AN INPUT FILE
0100ERROR CODE NOT IN TABLE
     SEND # TO ELLIS COMPUTING
0101 SUBSCRIPT ERROR VALUE EXCEEDS 64K
0102 BOUNDARY ERROR
0103
