// -------------------------------------------------------------
//	TITLE	:	MSX screen2 anime フレーム・フレーム間処理
//	INPUT	:	(C)2001	t.hara (HRA!)
//	HISTORY	:	2001/06/13	初版
// -------------------------------------------------------------

#ifndef	_ANICNV_H_
#define	_ANICNV_H_

// =============================================================
//	必須のインクルード

#include <stdio.h>

// =============================================================
//	関数プロトタイプ

int ac_sc2anime( const char* fname, int diff );

#endif	//	ndef _ANICNV_H_
